MyOrg.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>

* Linux Notes
** Manjaro Notes
*** Set Display Resolution 2K / 4K
      File : .config/xfce4/xfconf/xfce-perchannel-xml/displays.xml
      #+begin_src xml
        <!-- .config/xfce4/xfconf/xfce-perchannel-xml/displays.xml -->
        <?xml version="1.0" encoding="UTF-8"?>

        <channel name="displays" version="1.0">
          <property name="ActiveProfile" type="string" value="Default"/>
          <property name="Default" type="empty">
            <property name="HDMI1" type="string" value="AOC International 27&quot;">
              <property name="Active" type="bool" value="true"/>
              <property name="EDID" type="string" value="81c1b751232ac1702b80fc456c6d3c28287a33fc"/>
              <property name="Resolution" type="string" value="3200x1800"/>
              <property name="RefreshRate" type="double" value="29.963375"/>
              <property name="Rotation" type="int" value="0"/>
              <property name="Reflection" type="string" value="0"/>
              <property name="Primary" type="bool" value="true"/>
              <property name="Position" type="empty">
                <property name="X" type="int" value="0"/>
                <property name="Y" type="int" value="0"/>
              </property>
            </property>
            <property name="VGA1" type="string" value="BenQ 22&quot;">
              <property name="Active" type="bool" value="true"/>
              <property name="EDID" type="string" value="3f5053d14cdc210b298549e89133ab09493e219a"/>
              <property name="Resolution" type="string" value="1920x1080"/>
              <property name="RefreshRate" type="double" value="60.000000"/>
              <property name="Rotation" type="int" value="0"/>
              <property name="Reflection" type="string" value="0"/>
              <property name="Primary" type="bool" value="false"/>
              <property name="Position" type="empty">
                <property name="X" type="int" value="3200"/>
                <property name="Y" type="int" value="0"/>
              </property>
            </property>
          </property>
          <property name="Fallback" type="empty">
            <property name="HDMI1" type="string" value="AOC International 27&quot;">
              <property name="Active" type="bool" value="true"/>
              <property name="EDID" type="string" value="81c1b751232ac1702b80fc456c6d3c28287a33fc"/>
              <property name="Resolution" type="string" value="3200x1800"/>
              <property name="RefreshRate" type="double" value="29.963375"/>
              <property name="Rotation" type="int" value="0"/>
              <property name="Reflection" type="string" value="0"/>
              <property name="Primary" type="bool" value="true"/>
              <property name="Position" type="empty">
                <property name="X" type="int" value="0"/>
                <property name="Y" type="int" value="0"/>
              </property>
            </property>
            <property name="VGA1" type="string" value="BenQ 22&quot;">
              <property name="Active" type="bool" value="true"/>
              <property name="EDID" type="string" value="3f5053d14cdc210b298549e89133ab09493e219a"/>
              <property name="Resolution" type="string" value="1920x1080"/>
              <property name="RefreshRate" type="double" value="60.000000"/>
              <property name="Rotation" type="int" value="0"/>
              <property name="Reflection" type="string" value="0"/>
              <property name="Primary" type="bool" value="false"/>
              <property name="Position" type="empty">
                <property name="X" type="int" value="3200"/>
                <property name="Y" type="int" value="0"/>
              </property>
            </property>
          </property>
        </channel>
      #+end_src
*** Manual Setting Resolution
    #+begin_src bash
    cvt 1160 1600
    # 1160x1600 59.99 Hz (CVT) hsync: 99.46 kHz; pclk: 156.75 MHz
    Modeline "1160x1600_60.00"  156.75  1160 1248 1368 1576  1600 1603 1613 1658 -hsync +vsync

    xrandr --newmode "1160x1600_60.00"  156.75  1160 1248 1368 1576  1600 1603 1613 1658 -hsync +vsync
    xrandr --addmode Virtual1 1160x1600_60.00
    xrandr --output  Virtual1 --mode 1160x1600_60.00
    #+end_src
*** Automatic Add Resolution

      File : /etc/X11/xorg.conf.d/10-monitor.conf
      #+begin_src conf
      Section "Monitor"
          Identifier "HDMI1"
          Modeline "3200x1800_30.00"  233.00  3200 3384 3720 4240  1800 1803 1808 1834 -hsync +vsync
          Option "PreferredMode" "3200x1800_30.00"
      EndSection

      Section "Screen"
          Identifier "Screen0"
          Monitor "HDMI1"
          DefaultDepth 24
          SubSection "Display"
              Modes "3200x1800_30.00"
          EndSubSection
      EndSection

      Section "Device"
          Identifier "Device0"
          Driver "intel"
      EndSection
      #+end_src

