MyOrg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-23 Sat 11:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ron" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4c43f25">1. Linux Notes</a>
<ul>
<li><a href="#orgd5a987f">1.1. Manjaro Notes</a>
<ul>
<li><a href="#org2f9cee5">1.1.1. Set Display Resolution 2K / 4K</a></li>
<li><a href="#org7fff59b">1.1.2. Manual Setting Resolution</a></li>
<li><a href="#org066de03">1.1.3. Automatic Add Resolution</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4c43f25" class="outline-2">
<h2 id="org4c43f25"><span class="section-number-2">1</span> Linux Notes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd5a987f" class="outline-3">
<h3 id="orgd5a987f"><span class="section-number-3">1.1</span> Manjaro Notes</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2f9cee5" class="outline-4">
<h4 id="org2f9cee5"><span class="section-number-4">1.1.1</span> Set Display Resolution 2K / 4K</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
File : .config/xfce4/xfconf/xfce-perchannel-xml/displays.xml
</p>
<div class="org-src-container">
<pre class="src src-xml"><span style="color: #75715E;">&lt;!-- </span><span style="color: #75715E;">.config/xfce4/xfconf/xfce-perchannel-xml/displays.xml </span><span style="color: #75715E;">--&gt;</span>
<span style="color: #E6DB74;">&lt;?</span><span style="color: #F92672;">xml</span><span style="color: #E6DB74;"> </span><span style="color: #E6DB74;">version="1.0" encoding="UTF-8"</span><span style="color: #E6DB74;">?&gt;</span>

&lt;<span style="color: #A6E22E;">channel</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"displays"</span> <span style="color: #FD971F;">version</span>=<span style="color: #E6DB74;">"1.0"</span>&gt;
  &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"ActiveProfile"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"Default"</span>/&gt;
  &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Default"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"empty"</span>&gt;
    &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"HDMI1"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"AOC International 27</span><span style="color: #AE81FF;">&amp;</span><span style="color: #AE81FF;">quot</span><span style="color: #AE81FF;">;</span><span style="color: #E6DB74;">"</span>&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Active"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"bool"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"true"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"EDID"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"81c1b751232ac1702b80fc456c6d3c28287a33fc"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Resolution"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"3200x1800"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"RefreshRate"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"double"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"29.963375"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Rotation"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Reflection"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Primary"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"bool"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"true"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Position"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"empty"</span>&gt;
        &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"X"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
        &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Y"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;/<span style="color: #A6E22E;">property</span>&gt;
    &lt;/<span style="color: #A6E22E;">property</span>&gt;
    &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"VGA1"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"BenQ 22</span><span style="color: #AE81FF;">&amp;</span><span style="color: #AE81FF;">quot</span><span style="color: #AE81FF;">;</span><span style="color: #E6DB74;">"</span>&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Active"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"bool"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"true"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"EDID"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"3f5053d14cdc210b298549e89133ab09493e219a"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Resolution"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"1920x1080"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"RefreshRate"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"double"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"60.000000"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Rotation"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Reflection"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Primary"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"bool"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"false"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Position"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"empty"</span>&gt;
        &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"X"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"3200"</span>/&gt;
        &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Y"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;/<span style="color: #A6E22E;">property</span>&gt;
    &lt;/<span style="color: #A6E22E;">property</span>&gt;
  &lt;/<span style="color: #A6E22E;">property</span>&gt;
  &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Fallback"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"empty"</span>&gt;
    &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"HDMI1"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"AOC International 27</span><span style="color: #AE81FF;">&amp;</span><span style="color: #AE81FF;">quot</span><span style="color: #AE81FF;">;</span><span style="color: #E6DB74;">"</span>&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Active"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"bool"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"true"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"EDID"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"81c1b751232ac1702b80fc456c6d3c28287a33fc"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Resolution"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"3200x1800"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"RefreshRate"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"double"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"29.963375"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Rotation"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Reflection"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Primary"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"bool"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"true"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Position"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"empty"</span>&gt;
        &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"X"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
        &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Y"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;/<span style="color: #A6E22E;">property</span>&gt;
    &lt;/<span style="color: #A6E22E;">property</span>&gt;
    &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"VGA1"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"BenQ 22</span><span style="color: #AE81FF;">&amp;</span><span style="color: #AE81FF;">quot</span><span style="color: #AE81FF;">;</span><span style="color: #E6DB74;">"</span>&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Active"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"bool"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"true"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"EDID"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"3f5053d14cdc210b298549e89133ab09493e219a"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Resolution"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"1920x1080"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"RefreshRate"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"double"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"60.000000"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Rotation"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Reflection"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"string"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Primary"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"bool"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"false"</span>/&gt;
      &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Position"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"empty"</span>&gt;
        &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"X"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"3200"</span>/&gt;
        &lt;<span style="color: #A6E22E;">property</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"Y"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"int"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"0"</span>/&gt;
      &lt;/<span style="color: #A6E22E;">property</span>&gt;
    &lt;/<span style="color: #A6E22E;">property</span>&gt;
  &lt;/<span style="color: #A6E22E;">property</span>&gt;
&lt;/<span style="color: #A6E22E;">channel</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7fff59b" class="outline-4">
<h4 id="org7fff59b"><span class="section-number-4">1.1.2</span> Manual Setting Resolution</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-bash">cvt <span style="color: #AE81FF;">1160</span> <span style="color: #AE81FF;">1600</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">1160x1600 59.99 Hz (CVT) hsync: 99.46 kHz; pclk: 156.75 MHz</span>
Modeline <span style="color: #E6DB74;">"1160x1600_60.00"</span>  <span style="color: #AE81FF;">156.75</span>  <span style="color: #AE81FF;">1160</span> <span style="color: #AE81FF;">1248</span> <span style="color: #AE81FF;">1368</span> <span style="color: #AE81FF;">1576</span>  <span style="color: #AE81FF;">1600</span> <span style="color: #AE81FF;">1603</span> <span style="color: #AE81FF;">1613</span> <span style="color: #AE81FF;">1658</span> -hsync +vsync

xrandr --newmode <span style="color: #E6DB74;">"1160x1600_60.00"</span>  <span style="color: #AE81FF;">156.75</span>  <span style="color: #AE81FF;">1160</span> <span style="color: #AE81FF;">1248</span> <span style="color: #AE81FF;">1368</span> <span style="color: #AE81FF;">1576</span>  <span style="color: #AE81FF;">1600</span> <span style="color: #AE81FF;">1603</span> <span style="color: #AE81FF;">1613</span> <span style="color: #AE81FF;">1658</span> -hsync +vsync
xrandr --addmode Virtual1 <span style="color: #AE81FF;">1160x1600_60.00</span>
xrandr --output  Virtual1 --mode <span style="color: #AE81FF;">1160x1600_60.00</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org066de03" class="outline-4">
<h4 id="org066de03"><span class="section-number-4">1.1.3</span> Automatic Add Resolution</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
File : /etc/X11/xorg.conf.d/10-monitor.conf
</p>
<div class="org-src-container">
<pre class="src src-conf">Section <span style="color: #E6DB74;">"Monitor"</span>
    Identifier <span style="color: #E6DB74;">"HDMI1"</span>
    Modeline <span style="color: #E6DB74;">"3200x1800_30.00"</span>  233.00  3200 3384 3720 4240  1800 1803 1808 1834 -hsync +vsync
    Option <span style="color: #E6DB74;">"PreferredMode"</span> <span style="color: #E6DB74;">"3200x1800_30.00"</span>
EndSection

Section <span style="color: #E6DB74;">"Screen"</span>
    Identifier <span style="color: #E6DB74;">"Screen0"</span>
    Monitor <span style="color: #E6DB74;">"HDMI1"</span>
    DefaultDepth 24
    SubSection <span style="color: #E6DB74;">"Display"</span>
        Modes <span style="color: #E6DB74;">"3200x1800_30.00"</span>
    EndSubSection
EndSection

Section <span style="color: #E6DB74;">"Device"</span>
    Identifier <span style="color: #E6DB74;">"Device0"</span>
    Driver <span style="color: #E6DB74;">"intel"</span>
EndSection
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ron</p>
<p class="date">Created: 2020-05-23 Sat 11:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
